using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace IAUECProfessorsEvaluation.Core.Helper
{
    public static class Enums
    {
        public static string GetAddOrUpdateResualt(this int state)
        {
            switch (state)
            {
                case 1:
                    return "اضافه گردید";
                case 2:
                    return "آپدیت گردید";
                case 3:
                    return "عملیات ناموفق";
                case 4:
                    return "عملیات ناموفق: کد نوع نگاشت موجود نمی باشد";
                case 5:
                    return "عملیات ناموفق: ترم موجود نمی باشد";
                case 6:
                    return "عملیات ناموفق: دانشکده موجود نمی باشد";
                default:
                    return "نامعلوم";
            }
        }

        public enum AddOrUpdateRenurnValue
        {
            اضافه_گردید = 1,
            آپدیت_گردید = 2,
            عملیات_ناموفق = 3,
            کد_نوع_نگاشت_موجود_نمی_باشد = 4,
            ترم_موجود_نمی_باشد = 5,
            دانشکده_موجود_نمی_باشد = 6
        }

        public static string GetDeleteResualt(this int state)
        {
            switch (state)
            {
                case -1:
                    return "حذف نگردید";
                case 0:
                    return "موردی برای حذف یافت نگردید";
                case -3000:
                    return "گروه یااستادی یافت نگردید";
                default:
                    return "حذف گردید";
            }
        }
    }
    public enum IndicatorGroupName : byte
    {
        وضعیت_حضور_آنلاین_مدیر_گروه = 1,
        وضعیت_حضور_فیزیکی_مدیران_گروه = 2,
        میانگین_نمرات_دانشجو_گروه_در_یک_ترم_مقطعه_لیسانس = 3,

        میانگین_نمرات_دانشجو_گروه_در_یک_ترم_مقطعه_فوق_لیسانس = 4,
        درصد_دانشجویان_اخراجی = 5,
        درصد_دانشجویان_انصرافی = 6,
        نسبت_استاد_به_دانشجو_کارشناسی = 7,
        پروپوزال_های_تصویب_شده_در_گروه = 8,
        ارائه_به_موقع_برنامه_درسی_توسط_مدیرگروه_در_موعد_مقرر = 9,
        ضریب_مدیر_گروه = 10,
        نسبت_استاد_به_دانشجو_کارشناسی_ارشد = 11,

        وضعیت_سایر_جلسات_حضور_مدیر_گروه = 12,
        نسبت_تعداد_مشخصه_به_دانشجو = 13,
        اساتید_پژوهشی_فعال_گروه = 14,
        زمان_انتظار_پروپوزال_دانشجو = 15,

        تعطیلات_رسمی_کلاس_آنلاین_مدیر_گروه = 16,
        تعطیلات_رسمی_کلاس_فیزیکی_مدیر_گروه = 17,
        جلسات_شورای_آموزشی_پژوهشی = 18



    }

    public enum IndicatorProfessorName : byte
    {
        مرتبه_علمی = 1,
        سابقه_تدریس = 2,
        میزان_تحصیلات = 3,

        رتبه_دانشگاه_محل_تحصیل = 4,
        دانشگاه_محل_خدمت = 5,
        ارزشیابی_پایان_ترم = 6,
        تعداد_جلسات_برگزار_شده_کلاس = 7,
        وضعیت_ورود_و_خروج_استاد_در_کلاس = 8,
        وضعیت_اعلام_نمرات = 9,
        ارائه_به_موقع_سوالات_امتحانی = 10,
        وضعیت_دسترسی_به_استاد_و_تعامل_با_دانشکده = 11,
        نظر_مدیر_گروه = 12,
        عودت_اوراق_امتحانی = 13,
        امضاء_قرارداد_آموزشی = 14,
        ارائه_طرح_درس = 15,
        نظر_معاون_آموزشی = 16

    }
    public enum AddOrUpdateResualt : byte
    {
        اضافه_گردید = 1,
        آپدیت_گردید = 2,
        عملیات_ناموفق = 3

    }
    public enum RemoveResualt : byte
    {
        حذف_گردید = 1,
        حذف_نگردید = 2

    }
    public enum LogTypeValue : byte
    {
        شروع_سینک_ترم = 1,
        دریافت_ترم_از_سرویس = 2,
        عدم_دریافت_ترم_از_سرویس = 3,
        شروع_اضافه_و_آپدیت_نمودن_ترم = 4,
        پایان_اضافه_و_آپدیت_نمودن_ترم = 5,
        ترم_اضافه_شد = 6,
        ترم_آپدیت_شد = 7,
        مشکل_در_اضافه_و_آپدیت_کردن_ترم = 8,
        شروع_سینک_مپینگ = 9,
        دریافت_مپینگ_از_سرویس = 10,
        حذف_مپینگ_ها = 11,
        مشکل_در_حذف_مپینگ_ها = 12,
        یکی_از_مقادیر_نگاشت_موجود_نمی = 13,
        مپینگ_اضافه_گردید = 14,
        مپینگ_آپدیت_گردید = 15,
        مشکل_در_اضافه_و_آپدیت_کردن_مپینگ = 16,
        شروع_اضافه_و_آپدیت_نمودن_مپینگ = 17,
        پایان_اضافه_و_آپدیت_نمودن_مپینگ = 18,
        شروع_سینک_دانشکده = 19,
        دریافت_دانشکده_از_سرویس = 20,
        دانشکده_اضافه_گردید = 21,
        دانشکده_آپدیت_گردید = 22,
        عملیات_ناموفق_در_بروزرسانی_دانشکده = 23,
        عملیات_ناموفق_به_دلیل_عدم_وجود_حداقل_یک_مقدار_از_دانشکده = 24,
        شروع_سینک_اساتید = 25,
        دریافت_اساتید_از_سرویس = 26,
        اساتید_اضافه_گردید = 27,
        اساتید_آپدیت_گردید = 28,
        عملیات_ناموفق_در_بروزرسانی_اساتید = 29,
        عملیات_ناموفق_به_دلیل_عدم_وجود_حداقل_یک_مقدار_از_اساتید = 30,
        شروع_سینک_گروه = 31,
        دریافت_گروه_از_سرویس = 32,
        گروه_اضافه_گردید = 33,
        گروه_آپدیت_گردید = 34,
        عملیات_ناموفق_در_بروزرسانی_گروه = 35,
        عملیات_ناموفق_به_دلیل_عدم_وجود_حداقل_یک_مقدار_از_فیلد_های_گروه = 36,
        شروع_سینک_کلاس = 37,
        دریافت_کلاس_از_سرویس = 38,
        کلاس_اضافه_گردید = 39,
        کلاس_آپدیت_گردید = 40,
        عملیات_ناموفق_در_بروزرسانی_کلاس = 41,
        عملیات_ناموفق_به_دلیل_عدم_وجود_حداقل_یک_مقدار_از_کلاس = 42,
        شروع_سینک_دانشجو_کلاس = 43,
        دریافت_دانشجو_کلاس_از_سرویس = 44,
        دانشجو_کلاس_اضافه_گردید = 45,
        دانشجو_کلاس_آپدیت_گردید = 46,
        عملیات_ناموفق_در_بروزرسانی_دانشجو_کلاس = 47,
        عملیات_ناموفق_به_دلیل_عدم_وجود_حداقل_یک_مقدار_از_دانشجو_کلاس = 48,
        شروع_عملیات_حذف_امتیازات_اساتید = 49,
        _حذف_امتیازات_اساتید = 50,
        عملیات_ناموفق_به_دلیل_عدم_وجود_حداقل_یک_مقدار_از_فیلد_های_استاد = 51,
        عملیات_ناموفق_به_دلیل_عدم_وجود_استاد = 52,
        شروع_عملیات_ثبت_امتیازات_اساتید = 53,
        عملیات_ناموفق_جهت_ثبت_امتیازات_استاد = 54,
        شروع_عملیات_حذف_امتیازات_گروه = 55,
        حذف_امتیازات_گروه = 56,
        عملیات_ناموفق_به_دلیل_عدم_وجود_گروه = 57,
        شروع_عملیات_ثبت_امتیازات_گروه = 58,
        عملیات_ناموفق_جهت_ثبت_امتیازات_گروه = 59,
        شروع_عملیات_بروزرسانی_داده_ها = 60,
        پایان_عملیات_بروزرسانی_داده_ها = 61
    }

}
